Revit 2024 API
TranslationRotationValue Enumeration
 Specifies the type of condition applied to the translation or rotation parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum TranslationRotationValue
Visual Basic
Public Enumeration TranslationRotationValue
Visual C++
public enum class TranslationRotationValue
Members
Member name | Description
Fixed |  The type of condition is Fixed.
Release |  The type of condition is Release.
Spring |  The type of condition is Spring.
See Also
Autodesk.Revit.DB.Structure Namespace